import 'package:flutter/material.dart';
import 'package:flutter/widgets.dart';


class Privacy extends StatelessWidget {
  static const routeName = '/Privacy';
  static const routeName1 = '/privacy';

  Privacy() {}

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        centerTitle: true,
        title: Text('حریم خصوصی'),
      ),
      body: SingleChildScrollView(
        child: Container(
          padding: EdgeInsets.only(
            top: 20,
            left: 10,
            right: 10,
          ),
          child: Column(
            children: [
              Card(
                shape: RoundedRectangleBorder(
                    borderRadius: BorderRadius.circular(10.0)),
                elevation: 30,
                child: Column(
                  children: [
                    Container(
                      padding: EdgeInsets.all(15),
                      child: Text(
                        getNewLineString(),
                        style: Theme.of(context).textTheme.bodyText1,
                        textAlign: TextAlign.right,
                      ),
                    ),
                  ],
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }

  var readLines = [
    'رعایت حریم شخصی افراد برای کارال بسیار حائز اهمیت می باشد لذا اطلاعات به گونه ای گردآوری و محافظت می گردند که اطلاعات شخصی شما در معرض خطر قرار نگیرد. در ادامه، نحوه ذخیره سازی و استفاده از اطلاعاتی که در نتیجه ثبت نام و استفاده از کارال در این سامانه ثبت می گردد توضیح داده شده است. اطلاعات جمع آوری شده به دو دسته تقسیم می گردند.',
    'اطلاعات ثبت نامی',
    'اطلاعاتی که توسط کاربر جهت ثبت نام در کارال وارد می شود شامل اطلاعاتی چون نام، نام خانوادگی، شماره تماس، برند خودرو، رنگ خودرو، نوع پلاک و شماره پلاک می گردد. این دسته از اطلاعات در مرحله ثبت نام از دو نوع می باشند که شامل اطلاعات شخصی و اطلاعات خودرو می باشد. شایان ذکر است که اطلاعات شخصی شامل نام، نام خانوادگی و شماره تماس در اختیار کاربر غیر قرار نخواهد گفت و تنها جهت برقراری ارتباط ما بین سامانه و شما به کار گرفته می شود. این ارتباطات به سبب، ارائه خدمات تحت پوشش سامانه، اطلاع رسانی در خصوص خدمات تحت پوشش، کنترل کیفی، بررسی پیشبرد شکایات و ... مورد استفاده قرار می گیرند. بدیهیست مسئولیت حفظ و نگهداری از تمامی اطلاعات شخصی کاربران بر عهدا کارال می باشد به نحوی که هیچ شخصی اعم از حقیقی و حقوقی غیر ذی صلاح دسترسی به اطلاعات ذکر شده نداشته باشد. اطلاعات خودرو که شامل اطلاعات ظاهری خودرو می باشد در زمان اسکن بارکد توسط کاربر غیر قابل، جهت تطبیق و اطمینان از صحت روند کار، در سامانه نمایش داده می شود',
    'اطلاعات گردآوری شده',
    'این دسته از اطلاعات در نتیجه استفاده از سامانه کارال، در این سامانه ذخیره می گردد و شامل اطلاعاتی چون پیغام ارسالی یا دریافتی، زمان ارسال، پاسخ به پیغام و اطلاعاتی از این دست می گردد که به سبب پیگیری رخدادها و شکایات و تحلیل رویدادها به جهت ارائه خدمات بهتر ذخیره و مورد بهره برداری قرار می گیرند. این دسته از اطلاعات صرفا در دسترس کاربر و طرف مخاطب وی، و سامانه کارال می باشد و در دسترس افراد حقیقی و حقوقی غیر ذی صلاح قرار نخواهد گرفت',
  ];

  String getNewLineString() {
    StringBuffer sb = new StringBuffer();
    for (String line in readLines) {
      sb.write(line + "\n" + "\n");
    }
    return sb.toString();
  }
}
